jantielens/esp32-macropad/src/app/drivers/mipi_dsi_driver.cpp
/*
 * MIPI-DSI Display Driver Base Implementation (Direct ESP-IDF)
 * 
 * Shared implementation for all MIPI-DSI panel drivers on ESP32-P4.
 * Calls ESP-IDF MIPI-DSI APIs directly for:
 *   - DMA2D async flush (hardware-accelerated pixel copy)
 *   - disable_lp=true (continuous HS mode during blanking)
 *   - Backlight PWM control
 *   - Panel reset and initialization
 * 
 * Subclasses only need to provide their vendor init commands and DSI timing.
 */

#include "mipi_dsi_driver.h"
#include "../log_manager.h"
#include <string.h>

// MIPI DSI PHY power supply (LDO channel 3 on ESP32-P4)
#define MIPI_DSI_PHY_PWR_LDO_CHAN       3
#define MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV 2500

// Forward declaration of PPA completion callback (defined below pushColors).
bool onPpaDone(ppa_client_handle_t client,
               ppa_event_data_t* event_data,
               void* user_data);

// DMA2D completion callback — called from ISR when draw_bitmap finishes
// copying the LVGL buffer into the DPI framebuffer.  Signals LVGL that
// the draw buffer can be recycled.
static bool IRAM_ATTR onColorTransDone(esp_lcd_panel_handle_t panel,
                                       esp_lcd_dpi_panel_event_data_t* edata,
                                       void* user_ctx) {
    g_displayFlushBusy = false;
    lv_display_t* disp = (lv_display_t*)user_ctx;
    lv_display_flush_ready(disp);
    return false;
}

MipiDsiDriver::MipiDsiDriver()
    : framebuffer(nullptr), panel_handle(nullptr), ioHandle(nullptr),
      rotBuffer(nullptr), ppaClient(nullptr),
      currentBrightness(100),
      displayWidth(DISPLAY_WIDTH), displayHeight(DISPLAY_HEIGHT), displayRotation(DISPLAY_ROTATION),
      backlightOn(false), flushX(0), flushY(0), flushW(0), flushH(0), lvglDisplay(nullptr),
      physX(0), physY(0), physW(0), physH(0)
{
}

MipiDsiDriver::~MipiDsiDriver() {
    // Display is never torn down during normal operation.
}

void MipiDsiDriver::init() {
    const char* tag = getLogTag();
    MipiDsiTimingConfig timing = getTimingConfig();

    // ----------------------------------------------------------------
    // Attach backlight PWM BEFORE the LCD panel starts.
    // Configuring PWM first avoids GPIO glitches during panel scan start.
    // ----------------------------------------------------------------
    #ifdef LCD_BL_PIN
    #if HAS_BACKLIGHT
    #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttachChannel(LCD_BL_PIN, TFT_BACKLIGHT_PWM_FREQ, 8, TFT_BACKLIGHT_PWM_CHANNEL);
    ledcWrite(LCD_BL_PIN, 0);
    LOGI(tag, "Backlight PWM: GPIO%d, %dHz, 8-bit, ch%d (OFF)",
         LCD_BL_PIN, TFT_BACKLIGHT_PWM_FREQ, TFT_BACKLIGHT_PWM_CHANNEL);
    #else
    ledcSetup(TFT_BACKLIGHT_PWM_CHANNEL, TFT_BACKLIGHT_PWM_FREQ, 8);
    ledcAttachPin(LCD_BL_PIN, TFT_BACKLIGHT_PWM_CHANNEL);
    ledcWrite(TFT_BACKLIGHT_PWM_CHANNEL, 0);
    LOGI(tag, "Backlight PWM: GPIO%d, %dHz, 8-bit, ch%d (OFF)",
         LCD_BL_PIN, TFT_BACKLIGHT_PWM_FREQ, TFT_BACKLIGHT_PWM_CHANNEL);
    #endif
    #else
    pinMode(LCD_BL_PIN, OUTPUT);
    #ifdef TFT_BACKLIGHT_ON
    digitalWrite(LCD_BL_PIN, !TFT_BACKLIGHT_ON);
    #else
    digitalWrite(LCD_BL_PIN, LOW);
    #endif
    LOGI(tag, "Backlight digital: GPIO%d (OFF)", LCD_BL_PIN);
    #endif
    #endif
    
    // ----------------------------------------------------------------
    // Panel hardware reset
    // ----------------------------------------------------------------
    #ifdef LCD_RST_PIN
    pinMode(LCD_RST_PIN, OUTPUT);
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(5);
    digitalWrite(LCD_RST_PIN, LOW);
    delay(10);
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(120);
    LOGI(tag, "Panel reset: GPIO%d (HIGH-LOW-HIGH, 120ms)", LCD_RST_PIN);
    #endif
    
    // ----------------------------------------------------------------
    // Direct ESP-IDF MIPI-DSI initialization
    // ----------------------------------------------------------------
    
    LOGI(tag, "Initializing MIPI-DSI via direct ESP-IDF calls");
    LOGI(tag, "DSI timing: DPI_CLK=%luHz, lane_rate=%lu Mbps",
         (unsigned long)timing.dpi_clock_hz, (unsigned long)timing.lane_bit_rate_mbps);
    LOGI(tag, "DSI HSYNC: pw=%lu, bp=%lu, fp=%lu",
         (unsigned long)timing.hsync_pulse_width, (unsigned long)timing.hsync_back_porch,
         (unsigned long)timing.hsync_front_porch);
    LOGI(tag, "DSI VSYNC: pw=%lu, bp=%lu, fp=%lu",
         (unsigned long)timing.vsync_pulse_width, (unsigned long)timing.vsync_back_porch,
         (unsigned long)timing.vsync_front_porch);
    LOGI(tag, "DSI flags: disable_lp=%s, use_dma2d=true",
         timing.disable_lp ? "true" : "false");
    
    // 1. Power on MIPI DSI PHY via internal LDO (LDO_VO3 → VDD_MIPI_DPHY)
    esp_ldo_channel_handle_t ldo_mipi_phy = NULL;
    esp_ldo_channel_config_t ldo_config = {
        .chan_id = MIPI_DSI_PHY_PWR_LDO_CHAN,
        .voltage_mv = MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
    };
    ESP_ERROR_CHECK(esp_ldo_acquire_channel(&ldo_config, &ldo_mipi_phy));
    LOGI(tag, "MIPI DSI PHY powered on (LDO ch%d, %dmV)",
         MIPI_DSI_PHY_PWR_LDO_CHAN, MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV);
    
    // 2. Create DSI bus (2-lane, configured bit rate)
    esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = 2,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = timing.lane_bit_rate_mbps,
    };
    esp_lcd_dsi_bus_handle_t mipi_dsi_bus = NULL;
    ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus));
    
    // 3. Create DBI IO for DSI command channel (vendor init commands)
    esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    esp_lcd_panel_io_handle_t io_handle = NULL;
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_dbi(mipi_dsi_bus, &dbi_config, &io_handle));
    ioHandle = io_handle;  // Store for runtime DCS commands (sleep/wake)
    
    // 4. Create DPI panel with disable_lp=true and use_dma2d=true
    //    disable_lp: keeps D-PHY in HS mode during blanking (avoids flicker)
    //    use_dma2d: hardware-accelerated async pixel copy (avoids blocking CPU)
    //    num_fbs=2: double-buffered framebuffer. ESP-IDF mirrors draw_bitmap
    //      writes across both FBs so partial flushes stay coherent, and
    //      scanout reads one FB while draw_bitmap writes the other —
    //      eliminates the tear/flicker window inherent to single-FB mode.
    esp_lcd_dpi_panel_config_t dpi_config = {
        .virtual_channel = 0,
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
        .dpi_clock_freq_mhz = (uint32_t)(timing.dpi_clock_hz / 1000000),
        .pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB565,
        .num_fbs = 2,
        .video_timing = {
            .h_size = displayWidth,
            .v_size = displayHeight,
            .hsync_pulse_width = timing.hsync_pulse_width,
            .hsync_back_porch = timing.hsync_back_porch,
            .hsync_front_porch = timing.hsync_front_porch,
            .vsync_pulse_width = timing.vsync_pulse_width,
            .vsync_back_porch = timing.vsync_back_porch,
            .vsync_front_porch = timing.vsync_front_porch,
        },
        .flags = {
            .use_dma2d = true,
            .disable_lp = timing.disable_lp,
        },
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_dpi(mipi_dsi_bus, &dpi_config, &panel_handle));
    
    // 5. Send vendor init commands via DSI command mode
    sendInitCommands();
    
    // 6. Initialize DPI panel — starts continuous DMA refresh from PSRAM
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    
    // 7. Get PSRAM framebuffer pointers (allocated by ESP-IDF during panel creation).
    //    With num_fbs=2 the driver ping-pongs between fb0 and fb1 internally.
    void* fb0 = nullptr;
    void* fb1 = nullptr;
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_get_frame_buffer(panel_handle, 2, &fb0, &fb1));
    framebuffer = (uint16_t*)fb0;
    
    LOGI(tag, "DSI initialized: %dx%d, disable_lp=%s, use_dma2d=true, dual FB @ %p / %p",
         displayWidth, displayHeight, timing.disable_lp ? "true" : "false", fb0, fb1);
    
    delay(50);
    setBacklightBrightness(currentBrightness);
    
    // Rotation via PPA hardware (Pixel Processing Accelerator).
    // The DPI panel driver does NOT support swap_xy/mirror ops, so we
    // rotate each tile in pushColors() using PPA SRM before draw_bitmap().
    if (displayRotation != 0) {
        size_t rotBufSize = LVGL_BUFFER_SIZE * sizeof(uint16_t);
        rotBufSize = (rotBufSize + 63) & ~63; // cache-line alignment
        rotBuffer = (uint16_t*)heap_caps_aligned_alloc(64, rotBufSize, MALLOC_CAP_SPIRAM);
        if (!rotBuffer) {
            LOGE(tag, "Failed to allocate PPA rotation buffer (%u bytes)", (unsigned)rotBufSize);
        } else {
            ppa_client_config_t ppa_cfg = { .oper_type = PPA_OPERATION_SRM };
            ESP_ERROR_CHECK(ppa_register_client(&ppa_cfg, &ppaClient));
            // Register PPA async completion callback — chains into draw_bitmap()
            // after each tile rotation finishes.
            ppa_event_callbacks_t ppa_cbs = {};
            ppa_cbs.on_trans_done = onPpaDone;
            ESP_ERROR_CHECK(ppa_client_register_event_callbacks(ppaClient, &ppa_cbs));
            LOGI(tag, "PPA async rotation enabled: %u byte buffer @ %p", (unsigned)rotBufSize, rotBuffer);
        }
    }

    LOGI(tag, "Display ready: %dx%d @ rotation %d", width(), height(), displayRotation);
}

void MipiDsiDriver::setRotation(uint8_t rotation) {
    displayRotation = rotation;
}

int MipiDsiDriver::width() {
    return (displayRotation == 1 || displayRotation == 3) ? displayHeight : displayWidth;
}

int MipiDsiDriver::height() {
    return (displayRotation == 1 || displayRotation == 3) ? displayWidth : displayHeight;
}

void MipiDsiDriver::setBacklight(bool on) {
    setBacklightBrightness(on ? 100 : 0);
}

void MipiDsiDriver::setBacklightBrightness(uint8_t brightness) {
    if (brightness > 100) brightness = 100;
    currentBrightness = brightness;
    backlightOn = (brightness > 0);

    #ifdef LCD_BL_PIN
    #if HAS_BACKLIGHT
    uint32_t duty = 0;
    if (brightness >= 100) {
        duty = 255;
    } else if (brightness > 0) {
        duty = TFT_BACKLIGHT_DUTY_MIN + ((uint32_t)(brightness - 1) * (TFT_BACKLIGHT_DUTY_MAX - TFT_BACKLIGHT_DUTY_MIN)) / 98;
    }
    #ifdef TFT_BACKLIGHT_ON
    if (!TFT_BACKLIGHT_ON) duty = 255 - duty;
    #endif
    #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(LCD_BL_PIN, duty);
    #else
    ledcWrite(TFT_BACKLIGHT_PWM_CHANNEL, duty);
    #endif
    #else
    #ifdef TFT_BACKLIGHT_ON
    digitalWrite(LCD_BL_PIN, backlightOn ? TFT_BACKLIGHT_ON : !TFT_BACKLIGHT_ON);
    #else
    digitalWrite(LCD_BL_PIN, backlightOn ? HIGH : LOW);
    #endif
    #endif
    #endif
}

uint8_t MipiDsiDriver::getBacklightBrightness() {
    return currentBrightness;
}

bool MipiDsiDriver::hasBacklightControl() {
    #ifdef LCD_BL_PIN
    return true;
    #else
    return false;
    #endif
}

void MipiDsiDriver::applyDisplayFixes() {
    // No specific fixes needed for MIPI-DSI panels
}

void MipiDsiDriver::startWrite() {
    // No-op: esp_lcd_panel_draw_bitmap() in pushColors() handles everything
}

void MipiDsiDriver::endWrite() {
    // No-op: esp_lcd_panel_draw_bitmap() in pushColors() handles everything
}

void MipiDsiDriver::setAddrWindow(int16_t x, int16_t y, uint16_t w, uint16_t h) {
    flushX = x;
    flushY = y;
    flushW = w;
    flushH = h;
}

// PPA completion callback — called from PPA driver when async rotation finishes.
// Chains into draw_bitmap() which triggers DMA2D async copy to framebuffer.
// Safe because LVGL won't issue a new pushColors() until flush_ready() fires
// after the subsequent DMA2D copy completes (onColorTransDone ISR).
bool onPpaDone(ppa_client_handle_t client,
               ppa_event_data_t* event_data,
               void* user_ctx) {
    MipiDsiDriver* driver = (MipiDsiDriver*)user_ctx;
    // Issue DMA2D copy of rotated buffer to framebuffer.
    // g_displayFlushBusy was already set at the top of pushColors() and
    // remains true until onColorTransDone clears it.
    esp_lcd_panel_draw_bitmap(driver->panel_handle,
                              driver->physX, driver->physY,
                              driver->physX + driver->physW,
                              driver->physY + driver->physH,
                              driver->rotBuffer);
    // Note: DMA2D completion is handled by onColorTransDone → flush_ready
    return false;
}

void MipiDsiDriver::pushColors(uint16_t* data, uint32_t len, bool swap_bytes) {
    if (!panel_handle || !data || flushW == 0 || flushH == 0) {
        return;
    }

    // Mark flush in-flight for the entire duration of the push, covering both
    // the non-rotated direct DMA2D path and the rotated PPA→DMA2D chain.
    // Cleared by onColorTransDone ISR after the final DMA2D copy completes.
    g_displayFlushBusy = true;

    if (displayRotation == 0 || !rotBuffer || !ppaClient) {
        // No rotation — direct DMA2D async copy
        esp_lcd_panel_draw_bitmap(panel_handle,
                                  flushX, flushY,
                                  flushX + flushW, flushY + flushH,
                                  data);
        return;
    }

    // Rotate tile via ESP32-P4 PPA hardware, then DMA2D copy to framebuffer.
    // LVGL works in logical (portrait) coordinates; we transform each tile
    // to physical (landscape) panel coordinates.
    int px, py, pw, ph;
    ppa_srm_rotation_angle_t angle;

    if (displayRotation == 1) {
        // 90° CW: portrait → landscape
        // Logical (lx,ly) → Physical (displayWidth-1-ly, lx)
        px = displayWidth - flushY - flushH;
        py = flushX;
        pw = flushH;
        ph = flushW;
        angle = PPA_SRM_ROTATION_ANGLE_270; // 270° CCW = 90° CW
    } else if (displayRotation == 2) {
        // 180°
        px = displayWidth - flushX - flushW;
        py = displayHeight - flushY - flushH;
        pw = flushW;
        ph = flushH;
        angle = PPA_SRM_ROTATION_ANGLE_180;
    } else {
        // 270° CW (rotation == 3)
        // Logical (lx,ly) → Physical (ly, displayHeight-1-lx)
        px = flushY;
        py = displayHeight - flushX - flushW;
        pw = flushH;
        ph = flushW;
        angle = PPA_SRM_ROTATION_ANGLE_90; // 90° CCW = 270° CW
    }

    size_t outBufSize = (size_t)pw * ph * sizeof(uint16_t);
    outBufSize = (outBufSize + 63) & ~63; // cache-line alignment

    ppa_srm_oper_config_t srm = {};
    srm.in.buffer = data;
    srm.in.pic_w = flushW;
    srm.in.pic_h = flushH;
    srm.in.block_offset_x = 0;
    srm.in.block_offset_y = 0;
    srm.in.block_w = flushW;
    srm.in.block_h = flushH;
    srm.in.srm_cm = PPA_SRM_COLOR_MODE_RGB565;

    srm.out.buffer = rotBuffer;
    srm.out.buffer_size = outBufSize;
    srm.out.pic_w = pw;
    srm.out.pic_h = ph;
    srm.out.block_offset_x = 0;
    srm.out.block_offset_y = 0;
    srm.out.srm_cm = PPA_SRM_COLOR_MODE_RGB565;

    srm.rotation_angle = angle;
    srm.scale_x = 1.0f;
    srm.scale_y = 1.0f;

    // Save physical coords for PPA done callback → draw_bitmap().
    // Safe: LVGL won't call pushColors again until flush_ready() fires.
    physX = px;
    physY = py;
    physW = pw;
    physH = ph;

    // Non-blocking: PPA rotates in hardware, then onPpaDone() chains
    // into draw_bitmap() for DMA2D copy.  Meanwhile LVGL can render
    // the next tile into the alternate draw buffer (double buffering).
    srm.mode = PPA_TRANS_MODE_NON_BLOCKING;
    srm.user_data = this;

    esp_err_t err = ppa_do_scale_rotate_mirror(ppaClient, &srm);
    if (err != ESP_OK) {
        LOGE(getLogTag(), "PPA rotate failed: 0x%x", err);
        // Signal flush_ready so LVGL doesn't stall
        lv_display_flush_ready(lvglDisplay);
        return;
    }
}

void MipiDsiDriver::configureLVGL(lv_display_t* disp, uint8_t rotation) {
    lvglDisplay = disp;
    // Register DMA2D completion callback so LVGL knows the draw buffer
    // can be recycled once the hardware copy finishes.
    esp_lcd_dpi_panel_event_callbacks_t cbs = {};
    cbs.on_color_trans_done = onColorTransDone;
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_register_event_callbacks(panel_handle, &cbs, disp));
    LOGI(getLogTag(), "DMA2D flush callback registered");
}

bool MipiDsiDriver::asyncFlush() const {
    return true;
}

// Zero both DPI framebuffers and flush PSRAM cache so the scanout sees black.
// The ESP-IDF DPI peripheral keeps streaming the framebuffer over the MIPI
// lanes at 60 Hz even after DCS Sleep In, so the only reliable way to
// protect IPS cells from hours of identical content (image-persistence /
// ghosting) is to make sure that ongoing scanout reads all-zeros.
// (Note: esp_lcd_panel_disp_on_off() on the DPI panel handle is not
// implemented in our ESP-IDF version — it returns ESP_ERR_NOT_SUPPORTED
// and logs an error — so framebuffer blanking is the actual mitigation.)
void MipiDsiDriver::blankFramebuffers() {
    if (!panel_handle) return;
    void* fb0 = nullptr;
    void* fb1 = nullptr;
    if (esp_lcd_dpi_panel_get_frame_buffer(panel_handle, 2, &fb0, &fb1) != ESP_OK) {
        return;
    }
    const size_t fb_bytes = (size_t)displayWidth * (size_t)displayHeight * sizeof(uint16_t);
    if (fb0) {
        memset(fb0, 0, fb_bytes);
        esp_cache_msync(fb0, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    }
    if (fb1 && fb1 != fb0) {
        memset(fb1, 0, fb_bytes);
        esp_cache_msync(fb1, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    }
}

void MipiDsiDriver::sendInitCommands() {
    if (!ioHandle) return;
    const mipi_dsi_init_cmd_t* cmds = getInitCommands();
    const size_t num_cmds = getInitCommandCount();
    for (size_t i = 0; i < num_cmds; i++) {
        ESP_ERROR_CHECK(esp_lcd_panel_io_tx_param(
            ioHandle, cmds[i].cmd, cmds[i].data, cmds[i].data_bytes
        ));
        if (cmds[i].delay_ms > 0) {
            delay(cmds[i].delay_ms);
        }
    }
    LOGI(getLogTag(), "Sent %d vendor init commands", (int)num_cmds);
}

#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
// Deassert RST, wait for the panel IC to come out of reset, then re-run
// the full vendor init sequence. The JD9165 (and most TDDI controllers)
// require only ~10-20 ms post-RST settle before accepting DBI commands;
// 50 ms is a conservative margin that still saves ~70 ms of wake latency
// versus the cold-boot 120 ms. The vendor init table ends with Sleep Out
// (0x11, +120 ms) and Display On (0x29, +50 ms), so no additional DCS
// commands are needed after this returns.
void MipiDsiDriver::wakeFromHardReset() {
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(50);
    sendInitCommands();
}
#else
void MipiDsiDriver::wakeFromHardReset() {}
#endif

void MipiDsiDriver::displaySleep() {
    if (!ioHandle) return;

    // Blank framebuffers so the DPI peripheral's continuous scanout reads
    // black for the entire sleep period (image-retention mitigation).
    // We intentionally do NOT call esp_lcd_panel_disp_on_off(panel, false)
    // here — the DPI panel driver in our ESP-IDF version doesn't implement
    // it and would just log "disp_on_off is not supported by this panel".
    blankFramebuffers();

    // Standard DCS power-down: Display Off → Sleep In.
    esp_lcd_panel_io_tx_param(ioHandle, 0x28, NULL, 0);  // Display Off
    delay(20);
    esp_lcd_panel_io_tx_param(ioHandle, 0x10, NULL, 0);  // Sleep In

    // Optional deep sleep: hold panel RST LOW so the panel IC fully powers
    // down its internal regulators. Required on cheap IPS MIPI-DSI panels
    // (e.g. JD9165) where DCS Sleep In alone leaves the TFT cells DC-biased
    // and slowly drifts VCOM, producing washed-out colors after multi-hour
    // idle. Wake re-runs the vendor init sequence.
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    digitalWrite(LCD_RST_PIN, LOW);
#endif
}

void MipiDsiDriver::displayWake() {
    if (!ioHandle) return;
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    wakeFromHardReset();
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x11, NULL, 0);  // Sleep Out
    delay(120);                                           // MIPI DCS spec minimum
    esp_lcd_panel_io_tx_param(ioHandle, 0x29, NULL, 0);  // Display On
#endif
}

void MipiDsiDriver::displayWakeSleepOut() {
    if (!ioHandle) return;
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    // Hard-reset wake is single-phase (see needsTwoPhaseWake()): replay the
    // full init sequence here. The screensaver skips the 120 ms gap and the
    // second displayWakeDisplayOn() call so the display lock is only held
    // once, for the duration of wakeFromHardReset().
    wakeFromHardReset();
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x11, NULL, 0);  // Sleep Out
#endif
}

void MipiDsiDriver::displayWakeDisplayOn() {
    if (!ioHandle) return;
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    // Unreachable: needsTwoPhaseWake() returns false in hard-reset mode so
    // screen_saver_manager never calls this. Guarded out for safety.
    return;
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x29, NULL, 0);  // Display On
#endif
}

bool MipiDsiDriver::needsTwoPhaseWake() const {
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    return false;
#else
    return true;
#endif
}

// Periodic scrub during long idle. With hard-reset enabled the panel IC is
// already unpowered, so this is a no-op. Otherwise re-blank both framebuffers
// as insurance against any transient LVGL write that slipped past the opaque
// top-layer overlay (e.g. overlay teardown race during fade-in) leaving stale
// pixels in the FB to ghost into the IPS cells over hours.
void MipiDsiDriver::displayRefreshSleep() {
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    return;
#else
    blankFramebuffers();
#endif
}
